{
  "horny_hrad": "Horný hrad tvoril najstaršiu a najviac opevnenú časť hradu Korlátko, situovanú na najvyššom bode hradného kopca. Slúžil ako posledné útočisko posádky a centrum obrany.",
  
  "hradna_veza": "Hradná veža mala obrannú a pozorovaciu funkciu a umožňovala kontrolu obchodnej cesty prechádzajúcej Malými Karpatmi. Pravdepodobne išlo o dominantnú stavbu horného hradu.",
  
  "hradny_palac": "Hradný palác slúžil ako obytná a reprezentačná časť hradu, kde sídlil hradný pán a jeho družina. Obsahoval obytné miestnosti, skladové priestory a pravdepodobne aj kaplnku.",
  
  "nadvorie_horneho_hradu": "Nádvorie horného hradu bolo centrálnym priestorom medzi palácom a vežou, využívaným na každodenný chod hradu. Slúžilo na presun, zásobovanie a organizáciu obrany.",
  
  "prve_predhradie": "Prvé predhradie tvorilo prechodový obranný pás medzi horným hradom a nižšími časťami opevnenia. Plnilo ochrannú aj hospodársku funkciu.",
  
  "obytne_budovy_prveho_predhradia": "Obytné budovy prvého predhradia slúžili pre nižšiu hradnú posádku, remeselníkov a služobníctvo. Ich poloha mimo horného hradu zvyšovala bezpečnosť hlavného sídla.",
  
  "hospodarska_budova_prveho_predhradia": "Hospodárska budova v prvom predhradí bola určená na skladovanie potravín, náradia a zásob potrebných pre chod hradu. Zohrávala dôležitú úlohu pri dlhodobom obliehaní.",
  
  "nadvorie_prveho_predhradia": "Nádvorie prvého predhradia slúžilo ako pracovný a manipulačný priestor pre hospodárske činnosti. Zabezpečovalo prístup k obytným a hospodárskym budovám.",
  
  "druhe_predhradie": "Druhé predhradie predstavovalo rozsiahlejšiu obrannú zónu hradu, určenú na spomalenie útočníkov. Zároveň poskytovalo priestor pre hospodárske a vojenské objekty.",
  
  "vstupna_brana_do_hradu": "Vstupná brána do hradu bola dôležitým kontrolným bodom, chráneným opevnením a pravdepodobne aj bránovou vežou. Regulovala prístup do vnútorných častí hradu.",
  
  "hospodarska_budova": "Hospodárska budova v druhom predhradí slúžila na spracovanie a skladovanie surovín, ako aj na ustajnenie zvierat. Podporovala sebestačnosť hradného komplexu.",
  
  "basta_druheho_predhradia": "Bašta druhého predhradia bola obranným prvkom určeným na aktívnu obranu hradieb. Umožňovala bočné ostreľovanie prístupových ciest k hradu.",
  
  "nadvorie_druheho_predhradia": "Nádvorie druhého predhradia bolo otvoreným priestorom využívaným na presun vojska a hospodársku činnosť. Zároveň slúžilo ako zhromaždisko počas obrany.",
  
  "tretie_predhradie": "Tretie predhradie tvorilo najvonkajšiu líniu obrany hradu Korlátko. Jeho úlohou bolo včas zachytiť a oslabiť útočníka ešte pred hlavným opevnením.",
  
  "vypadova_brana": "Výpadová brána umožňovala posádke vykonávať výpady proti obliehateľom alebo opustiť hrad v núdzových situáciách. Bola strategicky umiestnená mimo hlavného vstupu.",
  
  "nadvorie_tretieho_predhradia": "Nádvorie tretieho predhradia slúžilo ako otvorený priestor pre logistiku, presun ľudí a materiálu. Zároveň tvorilo nárazníkovú zónu pred vnútornými časťami hradu."
}
