{
  "items": [
    {
      "key": "horny_hrad",
      "value": "The Upper Castle formed the oldest and most heavily fortified part of Korlátko Castle, situated at the highest point of the castle hill. It served as the last refuge of the garrison and the main defensive core."
    },
    {
      "key": "hradna_veza",
      "value": "The castle tower had defensive and observation functions and allowed control over the trade route passing through the Little Carpathians. It was likely the dominant structure of the Upper Castle."
    },
    {
      "key": "hradny_palac",
      "value": "The castle palace served as the residential and representative part of the castle, where the lord of the castle and his retinue resided. It contained living quarters, storage spaces, and probably a chapel."
    },
    {
      "key": "nadvorie_horneho_hradu",
      "value": "The courtyard of the Upper Castle was a central space between the palace and the tower, used for the daily operation of the castle. It served for movement, supply handling, and organization of defense."
    },
    {
      "key": "prve_predhradie",
      "value": "The first outer bailey formed a transitional defensive zone between the Upper Castle and the lower fortifications. It fulfilled both protective and economic functions."
    },
    {
      "key": "obytne_budovy_prveho_predhradia",
      "value": "The residential buildings of the first outer bailey were used by lower-ranking castle guards, craftsmen, and servants. Their location outside the Upper Castle increased the security of the main residence."
    },
    {
      "key": "hospodarska_budova_prveho_predhradia",
      "value": "The economic building in the first outer bailey was intended for storing food, tools, and supplies necessary for the operation of the castle. It played an important role during prolonged sieges."
    },
    {
      "key": "nadvorie_prveho_predhradia",
      "value": "The courtyard of the first outer bailey served as a working and handling area for economic activities. It provided access to residential and economic buildings."
    },
    {
      "key": "druhe_predhradie",
      "value": "The second outer bailey represented a more extensive defensive zone of the castle, designed to slow down attackers. It also provided space for economic and military structures."
    },
    {
      "key": "vstupna_brana_do_hradu",
      "value": "The entrance gate to the castle was an important control point, protected by fortifications and probably a gate tower. It regulated access to the inner parts of the castle."
    },
    {
      "key": "hospodarska_budova",
      "value": "The economic building in the second outer bailey was used for processing and storing raw materials as well as for housing animals. It supported the self-sufficiency of the castle complex."
    },
    {
      "key": "basta_druheho_predhradia",
      "value": "The bastion of the second outer bailey was a defensive element intended for active defense of the walls. It enabled flanking fire along the access routes to the castle."
    },
    {
      "key": "nadvorie_druheho_predhradia",
      "value": "The courtyard of the second outer bailey was an open area used for troop movement and economic activities. It also served as a gathering space during defense."
    },
    {
      "key": "tretie_predhradie",
      "value": "The third outer bailey formed the outermost line of defense of Korlátko Castle. Its purpose was to detect and weaken attackers before they reached the main fortifications."
    },
    {
      "key": "vypadova_brana",
      "value": "The sally port allowed the garrison to carry out sorties against besiegers or to leave the castle in emergency situations. It was strategically located away from the main entrance."
    },
    {
      "key": "nadvorie_tretieho_predhradia",
      "value": "The courtyard of the third outer bailey served as an open space for logistics and the movement of people and materials. It also formed a buffer zone before the inner parts of the castle."
    },
    {
      "key": "cerova",
      "value": "Cerová-Lieskové is a historic village mentioned in medieval sources, closely connected to the Korlátko Castle estate and the border defense system of the Kingdom of Hungary."
    },
    {
      "key": "jablonica",
      "value": "Jablonica is a historically significant settlement documented since the Middle Ages, associated with noble estates and later dominated by Jablonica Castle, an important seat of regional administration."
    }
  ]
}
